# Contents
## Importing libraries and data (customers.csv)
## Wrangling customers.csv
### &emsp; Dropping columns
### &emsp; Renaming columns
### &emsp; Checking data types
## Quality and Consistency checks on customers.csv
### &emsp; Missing values
### &emsp; Duplicates
### &emsp; Mixed-type data
## Merging customers.csv with orders_products_agg.pkl
## Exporting merged data as orders_products_all.pkl

# Importing Libraries

In [1]:
import pandas as pd
import numpy as np
import os

# Step 3: Importing the customer data set

In [2]:
# Turning project folder into a string

path = r'C:\Users\davau\OneDrive - College of the Sequoias\Career Foundry\Data Immersion\Achievement 4 (Python)\Instacart Basket Analysis'

In [3]:
# Importing customers.csv

df_cust = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))

In [4]:
df_cust.shape

(206209, 10)

In [5]:
df_cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [6]:
df_cust.tail()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
206204,168073,Lisa,Case,Female,North Carolina,44,4/1/2020,1,married,148828
206205,49635,Jeremy,Robbins,Male,Hawaii,62,4/1/2020,3,married,168639
206206,135902,Doris,Richmond,Female,Missouri,66,4/1/2020,2,married,53374
206207,81095,Rose,Rollins,Female,California,27,4/1/2020,1,married,99799
206208,80148,Cynthia,Noble,Female,New York,55,4/1/2020,1,married,57095

# Step 4: Wrangle the data

## Dropping Columns

In [7]:
#Dropping the 'First Name' and 'Surnam' columns

df_cust = df_cust.drop(columns = ['First Name','Surnam'])

In [8]:
df_cust.head()

,user_id,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Female,Maryland,26,1/1/2017,1,married,40374

## Renaming Columns

In [9]:
# Renaming the columns to make them more uniform and understandable

df_cust.rename(columns = {'Gender' : 'gender', 'STATE' : 'state', 'Age' : 'age', 'n_dependants' : 'number_of_dependants', 'fam_status' : 'family_status'}, inplace = True)

In [10]:
df_cust.head()

,user_id,gender,state,age,date_joined,number_of_dependants,family_status,income
0,26711,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Female,Maryland,26,1/1/2017,1,married,40374

## Changing Variable Types

In [11]:
df_cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 8 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   user_id               206209 non-null  int64
 1   gender                206209 non-null  object
 2   state                 206209 non-null  object
 3   age                   206209 non-null  int64
 4   date_joined           206209 non-null  object
 5   number_of_dependants  206209 non-null  int64
 6   family_status         206209 non-null  object
 7   income                206209 non-null  int64
dtypes: int64(4), object(4)
memory usage: 12.6+ MB

Let me import the dataset I'm going to merge this one with to see if I need to change the data type of the 'user_id' column.

In [12]:
# Importing orders_products_agg.pkl

ords_prods_agg = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_agg.pkl'))

In [13]:
ords_prods_agg.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32404859 entries, 0 to 32404858
Data columns (total 25 columns):
 #   Column                         Dtype
---  ------                         -----
 0   order_id                       int64
 1   user_id                        int64
 2   eval_set                       object
 3   order_number                   int64
 4   orders_day_of_week             int64
 5   order_hour_of_day              int64
 6   days_since_prior_order         float64
 7   product_id                     int64
 8   add_to_cart_order              int64
 9   reordered                      int64
 10  product_name                   object
 11  aisle_id                       int64
 12  department_id                  int64
 13  prices                         float64
 14  _merge                         category
 15  price_range_loc                object
 16  busiest_day                    object
 17  busiest_days                   object
 18  busiest_period_of_day          object
 19  max_order                      int64
 20  loyalty_flag                   object
 21  avg_price                      float64
 22  spending_flag                  object
 23  median_days_since_prior_order  float64
 24  order_frequency_flag           object
dtypes: category(1), float64(4), int64(11), object(9)
memory usage: 6.1+ GB

Ok, no need to change any variable types, then.

In [14]:
# Checking df_cust for mixed data types

for col in df_cust.columns.tolist():
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_cust[weird]) > 0:
    print (col)

No mixed data found.

# Step 5: Data quality and consistency checks

## Missing Values

In [15]:
# Checking df_cust for missing values

df_cust.isnull().sum()

user_id                 0
gender                  0
state                   0
age                     0
date_joined             0
number_of_dependants    0
family_status           0
income                  0
dtype: int64

No missing values.

## Duplicates

In [16]:
# Checking df_cust for full duplicates

df_dups = df_cust[df_cust.duplicated()]

In [17]:
df_dups

Empty DataFrame
Columns: [user_id, gender, state, age, date_joined, number_of_dependants, family_status, income]
Index: []

No duplicates.

## Mixed-type data

Checked above.  No mixed-type data found.

# Step 6: Combine customer data with other prepared data

## Some preliminary checks and changes

In [18]:
# Checking the shape of the two dfs

df_cust.shape

(206209, 8)

In [19]:
ords_prods_agg.shape

(32404859, 25)

In [20]:
# Dropping the '_merge' column from ords_prods_agg

ords_prods_agg = ords_prods_agg.drop(columns = ['_merge'])

In [21]:
ords_prods_agg.shape

(32404859, 24)

In [22]:
ords_prods_agg.head()

,order_id,user_id,eval_set,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,...,price_range_loc,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,avg_price,spending_flag,median_days_since_prior_order,order_frequency_flag
0,2539329,1,prior,1,2,8,NaN,196,1,0,...,Mid-range product,Regularly busy,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
1,2398795,1,prior,2,3,7,15.0,196,1,1,...,Mid-range product,Regularly busy,Least busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
2,473747,1,prior,3,3,12,21.0,196,1,1,...,Mid-range product,Regularly busy,Least busy,Most orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
3,2254736,1,prior,4,4,7,29.0,196,1,1,...,Mid-range product,Least busy,Least busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
4,431534,1,prior,5,4,15,28.0,196,1,1,...,Mid-range product,Least busy,Least busy,Most orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer

In Exercise 4.9, we found that many values in the 'prices' column of ords_prods_agg were larger than reasonable.  We replaced those prices with NaNs.  However, I didn't have the opportunity to export those changes, so I am going to make those changes again now, before merging the two datasets.

In [23]:
# Replacing prices over $100 with NaNs

ords_prods_agg.loc[ords_prods_agg['prices'] >100, 'prices'] = np.nan

In [24]:
ords_prods_agg['prices'].max()

25.0

## Merging ords_prods_agg with df_cust

In [25]:
# Merging...

df_combined = ords_prods_agg.merge(df_cust, on = 'user_id')

In [26]:
# Checking how the merger went

df_combined.shape

(32404859, 31)

In [27]:
df_combined.head()

,order_id,user_id,eval_set,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,...,spending_flag,median_days_since_prior_order,order_frequency_flag,gender,state,age,date_joined,number_of_dependants,family_status,income
0,2539329,1,prior,1,2,8,NaN,196,1,0,...,Low spender,20.5,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423
1,2398795,1,prior,2,3,7,15.0,196,1,1,...,Low spender,20.5,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423
2,473747,1,prior,3,3,12,21.0,196,1,1,...,Low spender,20.5,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423
3,2254736,1,prior,4,4,7,29.0,196,1,1,...,Low spender,20.5,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423
4,431534,1,prior,5,4,15,28.0,196,1,1,...,Low spender,20.5,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423

In [29]:
df_combined.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32404859 entries, 0 to 32404858
Data columns (total 31 columns):
 #   Column                         Dtype
---  ------                         -----
 0   order_id                       int64
 1   user_id                        int64
 2   eval_set                       object
 3   order_number                   int64
 4   orders_day_of_week             int64
 5   order_hour_of_day              int64
 6   days_since_prior_order         float64
 7   product_id                     int64
 8   add_to_cart_order              int64
 9   reordered                      int64
 10  product_name                   object
 11  aisle_id                       int64
 12  department_id                  int64
 13  prices                         float64
 14  price_range_loc                object
 15  busiest_day                    object
 16  busiest_days                   object
 17  busiest_period_of_day          object
 18  max_order                      int64
 19  loyalty_flag                   object
 20  avg_price                      float64
 21  spending_flag                  object
 22  median_days_since_prior_order  float64
 23  order_frequency_flag           object
 24  gender                         object
 25  state                          object
 26  age                            int64
 27  date_joined                    object
 28  number_of_dependants           int64
 29  family_status                  object
 30  income                         int64
dtypes: float64(4), int64(14), object(13)
memory usage: 7.7+ GB

# Step 8: Export new dataframe

In [30]:
# Exporting df_combined as orders_products_all.pkl 
df_combined.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_all.pkl'))